InformationRegisters/ПраваПользователейСистемыМеркурий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ПраваПользователейСистемыМеркурий</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиСистемыМеркурий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравоПользователя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПраваПользователейВСистемеМеркурий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПраваПользователейСистемыМеркурий/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
	
Функция ТекущиеПраваПользователя(Организация, Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПраваПользователейСистемыМеркурийСрезПоследних.ПравоПользователя КАК ПравоПользователя
		|ИЗ
		|	РегистрСведений.ПраваПользователейСистемыМеркурий.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И Пользователь = &Пользователь) КАК ПраваПользователейСистемыМеркурийСрезПоследних
		|ГДЕ
		|	ПраваПользователейСистемыМеркурийСрезПоследних.Используется";
	
	Запрос.УстановитьПараметр("Организация" , Организация);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ПраваПользователя = Новый Массив;
	
	ПраваПользователя = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПравоПользователя");
	
	Возврат ПраваПользователя;
КонецФункции

#КонецОбласти

#КонецЕсли
